In [2]:
import pandas as pd
import numpy as np
import math

### Reading files (Google Colab)

In [89]:
#from google.colab import files
#import io
#uploaded = files.upload()
#data = pd.read_csv(io.BytesIO(uploaded['file_name.csv']))

### Reading files

In [90]:
data = pd.read_csv('train.csv')
# see https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html

In [91]:
#data = pd.read_excel('tmp.xls')
# see https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html

In [92]:
#data = pd.read_json('tmp.json')
# see https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_json.html

### Series and DataFrame

In [93]:
type(data)

pandas.core.frame.DataFrame

In [94]:
data.columns

Index(['Id', 'MSSubClass', 'MSZoning', 'LotFrontage', 'LotArea', 'Street',
       'Alley', 'LotShape', 'LandContour', 'Utilities', 'LotConfig',
       'LandSlope', 'Neighborhood', 'Condition1', 'Condition2', 'BldgType',
       'HouseStyle', 'OverallQual', 'OverallCond', 'YearBuilt', 'YearRemodAdd',
       'RoofStyle', 'RoofMatl', 'Exterior1st', 'Exterior2nd', 'MasVnrType',
       'MasVnrArea', 'ExterQual', 'ExterCond', 'Foundation', 'BsmtQual',
       'BsmtCond', 'BsmtExposure', 'BsmtFinType1', 'BsmtFinSF1',
       'BsmtFinType2', 'BsmtFinSF2', 'BsmtUnfSF', 'TotalBsmtSF', 'Heating',
       'HeatingQC', 'CentralAir', 'Electrical', '1stFlrSF', '2ndFlrSF',
       'LowQualFinSF', 'GrLivArea', 'BsmtFullBath', 'BsmtHalfBath', 'FullBath',
       'HalfBath', 'BedroomAbvGr', 'KitchenAbvGr', 'KitchenQual',
       'TotRmsAbvGrd', 'Functional', 'Fireplaces', 'FireplaceQu', 'GarageType',
       'GarageYrBlt', 'GarageFinish', 'GarageCars', 'GarageArea', 'GarageQual',
       'GarageCond', 'PavedDrive', 'WoodDeckSF', 'OpenPorchSF',
       'EnclosedPorch', '3SsnPorch', 'ScreenPorch', 'PoolArea', 'PoolQC',
       'Fence', 'MiscFeature', 'MiscVal', 'MoSold', 'YrSold', 'SaleType',
       'SaleCondition', 'SalePrice'],
      dtype='object')

In [95]:
data.head()

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition,SalePrice
0,1,60,RL,65.0,8450,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2008,WD,Normal,208500
1,2,20,RL,80.0,9600,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,5,2007,WD,Normal,181500
2,3,60,RL,68.0,11250,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,9,2008,WD,Normal,223500
3,4,70,RL,60.0,9550,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2006,WD,Abnorml,140000
4,5,60,RL,84.0,14260,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,12,2008,WD,Normal,250000

In [96]:
data.sample(2)

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition,SalePrice
1337,1338,30,RM,153.0,4118,Pave,Grvl,IR1,Bnk,AllPub,...,0,NaN,NaN,NaN,0,3,2006,WD,Normal,52500
309,310,20,RL,90.0,12378,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,11,2006,WD,Normal,360000

In [97]:
type(data.Id)

pandas.core.series.Series

In [98]:
# creating dataframes

data = {'column_1':[1,2,3,5], 'column_2':['a','b','b','c'], 'column_3':[None, 0, -1, -4]}
df = pd.DataFrame(data)

In [99]:
df

   column_1 column_2  column_3
0         1        a       NaN
1         2        b       0.0
2         3        b      -1.0
3         5        c      -4.0

In [100]:
df1 = pd.DataFrame(data, index=['first', 'second', 'third', 'fourth'])
df1

        column_1 column_2  column_3
first          1        a       NaN
second         2        b       0.0
third          3        b      -1.0
fourth         5        c      -4.0

In [101]:
# new columns creation

df['new_column'] = df['column_1'] + 2*df['column_3']
df

   column_1 column_2  column_3  new_column
0         1        a       NaN         NaN
1         2        b       0.0         2.0
2         3        b      -1.0         1.0
3         5        c      -4.0        -3.0

In [102]:
np.random.seed(10)
df['random_column'] = np.random.randint(1, 10, size=4)
df

   column_1 column_2  column_3  new_column  random_column
0         1        a       NaN         NaN              5
1         2        b       0.0         2.0              1
2         3        b      -1.0         1.0              2
3         5        c      -4.0        -3.0              1

In [103]:
# columns transformation

#df['column_1'] = df['column_1'].apply(math.log)
df['column_1'] = df.column_1.apply(math.log)
df['column_2'] = df['column_2'].apply(lambda x: x if x == 'a' else x+'a')

In [104]:
df

   column_1 column_2  column_3  new_column  random_column
0  0.000000        a       NaN         NaN              5
1  0.693147       ba       0.0         2.0              1
2  1.098612       ba      -1.0         1.0              2
3  1.609438       ca      -4.0        -3.0              1

In [105]:
df.dtypes

column_1         float64
column_2          object
column_3         float64
new_column       float64
random_column      int64
dtype: object

In [106]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
column_1         4 non-null float64
column_2         4 non-null object
column_3         3 non-null float64
new_column       3 non-null float64
random_column    4 non-null int64
dtypes: float64(3), int64(1), object(1)
memory usage: 288.0+ bytes

In [107]:
df.columns

Index(['column_1', 'column_2', 'column_3', 'new_column', 'random_column'], dtype='object')

In [108]:
df.shape

(4, 5)

In [109]:
len(df)

4

In [148]:
# handling missing values

df.fillna(-100, inplace=True)
df

   column_1 column_2  column_3  random_column  new_column
0  0.000000        a    -100.0              5      -100.0
1  0.693147       ba       0.0              1      -100.0
2  1.098612       ba      -1.0              2      -100.0
3  1.609438       ca      -4.0              1      -100.0
4  0.000000       ca      -1.0           -100      -100.0
5  0.000000       ca      -1.0           -100         1.0

In [146]:
#new line adding

new_line = {'column_1': 0, 'column_2': 'ca', 'column_3': -1, 'new_column': 1, 'random_column': None}
df = df.append(new_line, ignore_index=True)

In [153]:
df

   column_1 column_2  column_3  random_column
0  0.000000        a    -100.0              5
1  0.693147       ba       0.0              1
3  1.609438       ca      -4.0              1
5  0.000000       ca      -1.0           -100

In [152]:
# row removal

df.drop([2, 4], axis=0, inplace=True)
df

KeyError: '[2 4] not found in axis'

In [151]:
# column removal

df.drop(['new_column'], axis=1, inplace=True)
df

KeyError: "['new_column'] not found in axis"

### Selection

In [115]:
# columns selection
df[['column_1', 'column_3']]

   column_1  column_3
0  0.000000    -100.0
1  0.693147       0.0
2  1.098612      -1.0
3  1.609438      -4.0
4  0.000000      -1.0

In [116]:
type(df[['column_1', 'column_3']])

pandas.core.frame.DataFrame

In [117]:
df['column_1']

0    0.000000
1    0.693147
2    1.098612
3    1.609438
4    0.000000
Name: column_1, dtype: float64

In [118]:
type(df['column_1'])

pandas.core.series.Series

In [119]:
# rows selection
df[1:]

   column_1 column_2  column_3 random_column
1  0.693147       ba       0.0             1
2  1.098612       ba      -1.0             2
3  1.609438       ca      -4.0             1
4  0.000000       ca      -1.0          None

In [120]:
df[:-1]

   column_1 column_2  column_3 random_column
0  0.000000        a    -100.0             5
1  0.693147       ba       0.0             1
2  1.098612       ba      -1.0             2
3  1.609438       ca      -4.0             1

In [121]:
df.loc[[0,1], ['column_1', 'column_3']] # works with names

   column_1  column_3
0  0.000000    -100.0
1  0.693147       0.0

In [122]:
df.iloc[[0,1], [0,2]] # works with positions

   column_1  column_3
0  0.000000    -100.0
1  0.693147       0.0

In [123]:
df.iloc[:, :2]

   column_1 column_2
0  0.000000        a
1  0.693147       ba
2  1.098612       ba
3  1.609438       ca
4  0.000000       ca

In [124]:
# masks
df[df.column_3 >= -4]

   column_1 column_2  column_3 random_column
1  0.693147       ba       0.0             1
2  1.098612       ba      -1.0             2
3  1.609438       ca      -4.0             1
4  0.000000       ca      -1.0          None

In [125]:
df[(df.column_1 > 0) & (df.column_2 != 'ca')]

   column_1 column_2  column_3 random_column
1  0.693147       ba       0.0             1
2  1.098612       ba      -1.0             2

In [126]:
df[(df.column_1 > 1) | (df.column_2 == 'a')]

   column_1 column_2  column_3 random_column
0  0.000000        a    -100.0             5
2  1.098612       ba      -1.0             2
3  1.609438       ca      -4.0             1

### Exercises

Work with dataset from 'train.csv' 

**Task 1:** Create a new dataset from columns 'SalePrice', 'OverallQual', 'YearBuilt', 'GarageYrBlt', 'OverallCond'

**Task 2:** Display rows for which SalePrice > 300000 and find number of such rows

**Task 3:** Display rows for which GarageYrBlt < YearBuilt and OverallQual is not more than 5; save new dataframe as data1

**Task 4:** Create new columns in data1 which reflects difference between YearBuilt and GarageYrBlt

In [4]:
data = pd.read_csv('train.csv')
# Task1
my_df = pd.DataFrame(data, columns=['SalePrice', 'OverallQual', 'YearBuilt', 'GarageYrBlt', 'OverallCond'])

# Task2
print(my_df[my_df["SalePrice"] > 300000])
# Task3
data1 = my_df[(my_df["GarageYrBlt"] < my_df["YearBuilt"]) & (my_df["OverallQual"] <= 5)]

# Task4 
data1["NewColumn"] = data1.YearBuilt - data1.GarageYrBlt

      SalePrice  OverallQual  YearBuilt  GarageYrBlt  OverallCond
6        307000            8       2004       2004.0            5
11       345000            9       2005       2005.0            5
20       325300            8       2005       2005.0            5
27       306000            8       2007       2008.0            5
35       309000            8       2004       2004.0            5
...         ...          ...        ...          ...          ...
1373     466500           10       2001       2001.0            5
1388     377500            9       2006       2006.0            5
1417     340000            8       1998       1998.0            5
1437     394617            8       2008       2008.0            5
1442     310000           10       2008       2008.0            5

[115 rows x 5 columns]

/Users/lenasoroka/anaconda3/envs/tensorflow/lib/python3.7/site-packages/ipykernel_launcher.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  # This is added back by InteractiveShellApp.init_path()

### Grouping and aggregating

In [128]:
df1

        column_1 column_2  column_3
first          1        a       NaN
second         2        b       0.0
third          3        b      -1.0
fourth         5        c      -4.0

In [129]:
df1.count()

column_1    4
column_2    4
column_3    3
dtype: int64

In [130]:
df1.max()

column_1    5
column_2    c
column_3    0
dtype: object

In [131]:
df1.column_1.max()

5

In [132]:
df1.min()

column_1    1
column_2    a
column_3   -4
dtype: object

In [133]:
df1.sum()

column_1      11
column_2    abbc
column_3      -5
dtype: object

In [134]:
df1.column_2.value_counts()

b    2
c    1
a    1
Name: column_2, dtype: int64

In [135]:
df1.column_2.unique()

array(['a', 'b', 'c'], dtype=object)

In [136]:
df1.column_2.nunique()

3

In [137]:
df1.describe()

       column_1  column_3
count  4.000000  3.000000
mean   2.750000 -1.666667
std    1.707825  2.081666
min    1.000000 -4.000000
25%    1.750000 -2.500000
50%    2.500000 -1.000000
75%    3.500000 -0.500000
max    5.000000  0.000000

In [138]:
# groupby
df1.groupby('column_2').groups.keys()

dict_keys(['a', 'b', 'c'])

In [139]:
df1.groupby('column_2').groups

{'a': Index(['first'], dtype='object'),
 'b': Index(['second', 'third'], dtype='object'),
 'c': Index(['fourth'], dtype='object')}

In [140]:
df1

        column_1 column_2  column_3
first          1        a       NaN
second         2        b       0.0
third          3        b      -1.0
fourth         5        c      -4.0

In [141]:
df1.groupby('column_2')['column_1'].sum()

column_2
a    1
b    5
c    5
Name: column_1, dtype: int64

In [142]:
aggregations = {
    'column_1': sum,
    'column_3': lambda x: np.isnan(x).sum()
}
df1.groupby('column_2').agg(aggregations)

          column_1  column_3
column_2
a                1       1.0
b                5       0.0
c                5       0.0

In [143]:
# aggregation with relabelling

df1.groupby('column_2').aggregate(
    {'column_1' : {'max_value': max},
    'column_3': {'num_not_nans': lambda x:  (~np.isnan(x)).sum()}})

          column_1     column_3
         max_value num_not_nans
column_2
a                1          0.0
b                3          2.0
c                5          1.0

In [144]:
# writing to file

In [ ]:
#df1.to_csv('my_dataframe.csv', index=False)
#df1.to_excel('my_dataframe.xlsx', index=False)

Further reading:  
https://pandas.pydata.org/pandas-docs/stable/reference/  
https://www.learndatasci.com/tutorials/python-pandas-tutorial-complete-introduction-for-beginners/  
https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/  
https://intoli.com/blog/pandas-aggregation/